Tekla.Structures.Drawing.PickerInputObject
The PickerInputObject class represents a pick of an object in a view.
Used for values asked by UI.Picker.PickObject(string Prompt, out DrawingObject PickedObject, out ViewBase PickedView).

Tekla.Structures.Drawing.PickerInputObject.PickedObject
Gets or sets the picked object in the view.

Tekla.Structures.Drawing.PickerInputObject.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PickerInputObject.#ctor(Tekla.Structures.Drawing.DrawingObject)
Creates a new PickerInputObject instance representing the pick of a drawing object in a view.
pickedObject: The picked drawing object.